#### MySQL Exercise 9: Subqueries and Derived Tables

#### Start by loading the sql library and database, and making the Dognition database your default database:

In [1]:
%load_ext sql
%sql mysql://studentuser:studentpw@mysqlserver/dognitiondb
%sql USE dognitiondb

0 rows affected.

[]

#### Question 1: How could you use a subquery to extract all the data from exam_answers that had test durations that were greater than the average duration for the "Yawn Warm-Up" game? Start by writing the query that gives you the average duration for the "Yawn Warm-Up" game by itself

In [6]:
%%sql
SELECT AVG(TIMESTAMPDIFF(minute,start_time,end_time)) AS AvgDuration
FROM exam_answers
WHERE TIMESTAMPDIFF(minute,start_time,end_time)>0 AND test_name="Yawn Warm-Up";

1 rows affected.

[(Decimal('9933.5197'),)]

#### Question 2: Once you've verified that your subquery is written correctly on its own, incorporate it into a main query to extract all the data from exam_answers that had test durations that were greater than the average duration for the "Yawn Warm-Up" game

In [4]:
%%sql
SELECT *
FROM exam_answers
WHERE TIMESTAMPDIFF(minute,start_time,end_time) >
(SELECT AVG(TIMESTAMPDIFF(minute,start_time,end_time)) AS AvgDuration
FROM exam_answers
WHERE TIMESTAMPDIFF(minute,start_time,end_time)>0 AND
test_name="Yawn Warm-Up")
LIMIT 10;

10 rows affected.

[(537, 'Sociability', 'Sociability', 'question', datetime.datetime(2013, 2, 5, 3, 58, 13), datetime.datetime(2013, 10, 2, 20, 18, 6), 0, 'fd27b272-7144-11e5-ba71-058fbc01cf0b'),
 (538, 'Emotions', 'Emotions', 'question', datetime.datetime(2013, 2, 5, 3, 58, 31), datetime.datetime(2013, 10, 2, 20, 18, 6), 0, 'fd27b272-7144-11e5-ba71-058fbc01cf0b'),
 (539, 'Shy/Boldness', 'Shy/Boldness', 'question', datetime.datetime(2013, 2, 5, 3, 59, 3), datetime.datetime(2013, 10, 2, 20, 18, 6), 0, 'fd27b272-7144-11e5-ba71-058fbc01cf0b'),
 (540, 'Perception', 'Perception', 'question', datetime.datetime(2013, 2, 5, 3, 59, 10), datetime.datetime(2013, 10, 2, 20, 18, 6), 0, 'fd27b272-7144-11e5-ba71-058fbc01cf0b'),
 (541, 'Recall', 'Recall', 'question', datetime.datetime(2013, 2, 5, 3, 59, 22), datetime.datetime(2013, 10, 2, 20, 18, 6), 0, 'fd27b272-7144-11e5-ba71-058fbc01cf0b'),
 (542, 'Attachment', 'Attachment', 'question', datetime.datetime(2013, 2, 5, 3, 59, 36), datetime.datetime(2013, 10, 2, 20, 18, 6), 0, 'fd27b272-7144-11e5-ba71-058fbc01cf0b'),
 (543, 'Puzzles', 'Puzzles', 'question', datetime.datetime(2013, 2, 5, 3, 59, 41), datetime.datetime(2013, 10, 2, 20, 18, 6), 0, 'fd27b272-7144-11e5-ba71-058fbc01cf0b'),
 (544, 'Shy/Boldness', 'Shy/Boldness', 'question', datetime.datetime(2013, 2, 5, 4, 0), datetime.datetime(2013, 10, 2, 20, 18, 6), 0, 'fd27b272-7144-11e5-ba71-058fbc01cf0b'),
 (545, 'Shy/Boldness', 'Shy/Boldness', 'question', datetime.datetime(2013, 2, 5, 4, 0, 16), datetime.datetime(2013, 10, 2, 20, 18, 6), 0, 'fd27b272-7144-11e5-ba71-058fbc01cf0b'),
 (546, 'Partnership', 'Partnership', 'question', datetime.datetime(2013, 2, 5, 4, 0, 35), datetime.datetime(2013, 10, 2, 20, 18, 6), 0, 'fd27b272-7144-11e5-ba71-058fbc01cf0b')]

#### Question 3: Use an IN operator to determine how many entries in the exam_answers tables are from the "Puzzles", "Numerosity", or "Bark Game" tests. You should get a count of 163022.

In [13]:
%%sql
SELECT COUNT(*)
FROM exam_answers
WHERE subcategory_name IN ('Puzzles','Numerosity','Bark Game');

1 rows affected.

[(163022,)]

#### Question 4: Use a NOT IN operator to determine how many unique dogs in the dog table are NOT in the "Working", "Sporting", or "Herding" breeding groups. You should get an answer of 7961.

In [15]:
%%sql
SELECT COUNT(DISTINCT dog_guid)
FROM dogs
WHERE breed_group NOT IN ('Working','Sporting','Herding');

1 rows affected.

[(7961,)]

#### Question 5: How could you determine the number of unique users in the users table who were NOT in the dogs table using a NOT EXISTS clause?

In [17]:
%%sql
SELECT DISTINCT u.user_guid AS uUserID
FROM users u
WHERE NOT EXISTS (SELECT d.user_guid
FROM dogs d
WHERE u.user_guid =d.user_guid)
LIMIT 10;

10 rows affected.

[('ce134f50-7144-11e5-ba71-058fbc01cf0b',),
 ('ce135888-7144-11e5-ba71-058fbc01cf0b',),
 ('ce1359aa-7144-11e5-ba71-058fbc01cf0b',),
 ('ce135fea-7144-11e5-ba71-058fbc01cf0b',),
 ('ce1360a8-7144-11e5-ba71-058fbc01cf0b',),
 ('ce13642c-7144-11e5-ba71-058fbc01cf0b',),
 ('ce1364d6-7144-11e5-ba71-058fbc01cf0b',),
 ('ce13663e-7144-11e5-ba71-058fbc01cf0b',),
 ('ce136792-7144-11e5-ba71-058fbc01cf0b',),
 ('ce136832-7144-11e5-ba71-058fbc01cf0b',)]

#### Question 6: Write a query using an IN clause and equijoin syntax that outputs the dog_guid, breed group, state of the owner, and zip of the owner for each distinct dog in the Working, Sporting, and Herding breed groups.

In [18]:
%%sql
SELECT DISTINCT d.dog_guid, d.breed_group, u.state, u.zip
FROM dogs d, users u
WHERE breed_group IN ('Working','Sporting','Herding') AND d.user_guid=u.user_guid
LIMIT 10;

10 rows affected.

[('fd27b272-7144-11e5-ba71-058fbc01cf0b', 'Sporting', 'ND', '58201'),
 ('fd27b5ba-7144-11e5-ba71-058fbc01cf0b', 'Herding', 'MA', '1005'),
 ('fd27b6b4-7144-11e5-ba71-058fbc01cf0b', 'Sporting', 'CT', '6820'),
 ('fd27b79a-7144-11e5-ba71-058fbc01cf0b', 'Sporting', 'IL', '60093'),
 ('fd27b948-7144-11e5-ba71-058fbc01cf0b', 'Working', 'WA', '98001'),
 ('fd27c1c2-7144-11e5-ba71-058fbc01cf0b', 'Sporting', 'WA', '98117'),
 ('fd27c7d0-7144-11e5-ba71-058fbc01cf0b', 'Sporting', 'CA', '95003'),
 ('fd27c8d4-7144-11e5-ba71-058fbc01cf0b', 'Working', 'VA', '22903'),
 ('fd27cf28-7144-11e5-ba71-058fbc01cf0b', 'Sporting', 'WY', '82401'),
 ('fd27cfaa-7144-11e5-ba71-058fbc01cf0b', 'Herding', 'IL', '60030')]

#### Question 7: Write the same query as in Question 6 using traditional join syntax.

In [20]:
%%sql
SELECT DISTINCT d.dog_guid, d.breed_group, u.state, u.zip
FROM dogs d JOIN users u
ON d.user_guid=u.user_guid
WHERE breed_group IN ('Working','Sporting','Herding')
LIMIT 10;

10 rows affected.

[('fd27b272-7144-11e5-ba71-058fbc01cf0b', 'Sporting', 'ND', '58201'),
 ('fd27b5ba-7144-11e5-ba71-058fbc01cf0b', 'Herding', 'MA', '1005'),
 ('fd27b6b4-7144-11e5-ba71-058fbc01cf0b', 'Sporting', 'CT', '6820'),
 ('fd27b79a-7144-11e5-ba71-058fbc01cf0b', 'Sporting', 'IL', '60093'),
 ('fd27b948-7144-11e5-ba71-058fbc01cf0b', 'Working', 'WA', '98001'),
 ('fd27c1c2-7144-11e5-ba71-058fbc01cf0b', 'Sporting', 'WA', '98117'),
 ('fd27c7d0-7144-11e5-ba71-058fbc01cf0b', 'Sporting', 'CA', '95003'),
 ('fd27c8d4-7144-11e5-ba71-058fbc01cf0b', 'Working', 'VA', '22903'),
 ('fd27cf28-7144-11e5-ba71-058fbc01cf0b', 'Sporting', 'WY', '82401'),
 ('fd27cfaa-7144-11e5-ba71-058fbc01cf0b', 'Herding', 'IL', '60030')]

#### Question 8: Earlier we examined unique users in the users table who were NOT in the dogs table. Use a NOT EXISTS clause to examine all the users in the dogs table that are not in the users table (you should get 2 rows in your output)

In [11]:
%%sql
SELECT d.user_guid AS dUserID, d.dog_guid AS dDogID
FROM dogs d
WHERE NOT EXISTS (SELECT DISTINCT u.user_guid
FROM users u
WHERE d.user_guid =u.user_guid);

2 rows affected.

[(None, 'fd7c0a66-7144-11e5-ba71-058fbc01cf0b'),
 (None, 'fdbb6b7a-7144-11e5-ba71-058fbc01cf0b')]

#### Question 9: We saw earlier that user_guid 'ce7b75bc-7144-11e5-ba71-058fbc01cf0b' still ends up with 1819 rows of output after a left outer join with the dogs table. If you investigate why, you'll find out that's because there are duplicate user_guids in the dogs table as well. How would you adapt the query we wrote earlier (copied below) to only join unique UserIDs from the users table with unique UserIDs from the dog table?

In [12]:
%%sql
SELECT DistinctUUsersID.user_guid AS uUserID, d.user_guid AS dUserID, count(*) AS
numrows
FROM (SELECT DISTINCT u.user_guid
FROM users u
WHERE u.user_guid='ce7b75bc-7144-11e5-ba71-058fbc01cf0b') AS
DistinctUUsersID
LEFT JOIN dogs d
ON DistinctUUsersID.user_guid=d.user_guid
GROUP BY DistinctUUsersID.user_guid
ORDER BY numrows DESC;

1 rows affected.

[('ce7b75bc-7144-11e5-ba71-058fbc01cf0b', 'ce7b75bc-7144-11e5-ba71-058fbc01cf0b', 1819)]

#### Question 10: Now let's prepare and test the inner query for the right half of the join. Give the dogs table an alias, and write a query that would select the distinct user_guids from the dogs table

In [22]:
%%sql
SELECT DISTINCT d.user_guid
FROM dogs d
LIMIT 10;

10 rows affected.

[(None,),
 ('ce134492-7144-11e5-ba71-058fbc01cf0b',),
 ('ce134a78-7144-11e5-ba71-058fbc01cf0b',),
 ('ce134be0-7144-11e5-ba71-058fbc01cf0b',),
 ('ce134d16-7144-11e5-ba71-058fbc01cf0b',),
 ('ce134e42-7144-11e5-ba71-058fbc01cf0b',),
 ('ce13507c-7144-11e5-ba71-058fbc01cf0b',),
 ('ce135194-7144-11e5-ba71-058fbc01cf0b',),
 ('ce1352ac-7144-11e5-ba71-058fbc01cf0b',),
 ('ce1353d8-7144-11e5-ba71-058fbc01cf0b',)]

#### Question 11: Now insert the query you wrote in Question 10 as a subquery on the right part of the join you wrote in question 9. The output should return columns that should have matching user_guids, and 1 row in the numrows column with a value of 1. If you are getting errors, make sure you have given an alias to the derived table you made to extract the distinct user_guids from the dogs table, and double-check that your aliases are referenced correctly in the SELECT and ON statements.

In [27]:
%%sql
SELECT DistinctUUsersID.user_guid AS uUserID, DistictDUsersID.user_guid AS
dUserID, count(*) AS numrows
FROM (SELECT DISTINCT u.user_guid
FROM users u
WHERE u.user_guid='ce7b75bc-7144-11e5-ba71-058fbc01cf0b') AS
DistinctUUsersID
LEFT JOIN (SELECT DISTINCT d.user_guid
FROM dogs d) AS DistictDUsersID
ON DistinctUUsersID.user_guid=DistictDUsersID.user_guid
GROUP BY DistinctUUsersID.user_guid
ORDER BY numrows DESC;

1 rows affected.

[('ce7b75bc-7144-11e5-ba71-058fbc01cf0b', 'ce7b75bc-7144-11e5-ba71-058fbc01cf0b', 1)]

#### 12: Adapt the query from Question 10 so that, in theory, you would retrieve a full list of all the DogIDs a user in the users table owns, with its accompagnying breed information whenever possible.

In [28]:
%%sql
SELECT DistinctUUsersID.user_guid AS uUserID, DistictDUsersID.user_guid AS
dUserID,
DistictDUsersID.dog_guid AS DogID, DistictDUsersID.breed AS breed
FROM (SELECT DISTINCT u.user_guid
FROM users u
LIMIT 100) AS DistinctUUsersID
LEFT JOIN (SELECT DISTINCT d.user_guid, d.dog_guid, d.breed
FROM dogs d) AS DistictDUsersID
ON DistinctUUsersID.user_guid=DistictDUsersID.user_guid
GROUP BY DistinctUUsersID.user_guid
LIMIT 10;

10 rows affected.

[('ce134a78-7144-11e5-ba71-058fbc01cf0b', 'ce134a78-7144-11e5-ba71-058fbc01cf0b', 'fd3d1b44-7144-11e5-ba71-058fbc01cf0b', 'Shih Tzu'),
 ('ce134be0-7144-11e5-ba71-058fbc01cf0b', 'ce134be0-7144-11e5-ba71-058fbc01cf0b', 'fd27c956-7144-11e5-ba71-058fbc01cf0b', 'German Shepherd Dog-Nova Scotia Duck Tolling Retriever Mix'),
 ('ce134e42-7144-11e5-ba71-058fbc01cf0b', 'ce134e42-7144-11e5-ba71-058fbc01cf0b', 'fd27b272-7144-11e5-ba71-058fbc01cf0b', 'Labrador Retriever'),
 ('ce13507c-7144-11e5-ba71-058fbc01cf0b', 'ce13507c-7144-11e5-ba71-058fbc01cf0b', 'fd27b79a-7144-11e5-ba71-058fbc01cf0b', 'Golden Retriever'),
 ('ce135194-7144-11e5-ba71-058fbc01cf0b', 'ce135194-7144-11e5-ba71-058fbc01cf0b', 'fd27e026-7144-11e5-ba71-058fbc01cf0b', 'Dalmatian'),
 ('ce1353d8-7144-11e5-ba71-058fbc01cf0b', 'ce1353d8-7144-11e5-ba71-058fbc01cf0b', 'fd27b5ba-7144-11e5-ba71-058fbc01cf0b', 'Shetland Sheepdog'),
 ('ce135766-7144-11e5-ba71-058fbc01cf0b', 'ce135766-7144-11e5-ba71-058fbc01cf0b', 'fd3ccf2c-7144-11e5-ba71-058fbc01cf0b', 'Shih Tzu'),
 ('ce135ab8-7144-11e5-ba71-058fbc01cf0b', 'ce135ab8-7144-11e5-ba71-058fbc01cf0b', 'fd27b6b4-7144-11e5-ba71-058fbc01cf0b', 'Golden Retriever'),
 ('ce135bd0-7144-11e5-ba71-058fbc01cf0b', 'ce135bd0-7144-11e5-ba71-058fbc01cf0b', 'fd27d9fa-7144-11e5-ba71-058fbc01cf0b', 'Mixed'),
 ('ce135e14-7144-11e5-ba71-058fbc01cf0b', 'ce135e14-7144-11e5-ba71-058fbc01cf0b', 'fd27b86c-7144-11e5-ba71-058fbc01cf0b', 'Shih Tzu')]

#### Question 13: You might have a good guess by now about why there are duplicate rows in the dogs table and users table, even though most corporate databases are configured to prevent duplicate rows from ever being accepted.

In [24]:
%%sql
SELECT DistictUUsersID.user_guid AS userid, d.breed, d.weight, count(*) AS numrows
FROM (SELECT DISTINCT u.user_guid
FROM users u) AS DistictUUsersID
LEFT JOIN dogs d
ON DistictUUsersID.user_guid=d.user_guid
GROUP BY DistictUUsersID.user_guid
HAVING numrows>10
ORDER BY numrows DESC;

5 rows affected.

[('ce7b75bc-7144-11e5-ba71-058fbc01cf0b', 'Shih Tzu', 190, 1819),
 ('ce225842-7144-11e5-ba71-058fbc01cf0b', 'Shih Tzu', 190, 26),
 ('ce2258a6-7144-11e5-ba71-058fbc01cf0b', 'Shih Tzu', 190, 20),
 ('ce135e14-7144-11e5-ba71-058fbc01cf0b', 'Shih Tzu', 190, 13),
 ('ce29675e-7144-11e5-ba71-058fbc01cf0b', 'Labrador Retriever- Mix', 60, 11)]